/* global $*/

//https://stackoverflow.com/questions/11922383/how-can-i-access-and-process-nested-objects-arrays-or-json
//https://stackoverflow.com/questions/983267/how-to-access-the-first-property-of-a-javascript-object

var restshop_arr =
	[
		['ခိုင်လီ', [
			'ကြက်ချဥ်စပ် (၆၀၀၀ ကျပ်)', 
			'ငါးသံပုရာပေါင်း (၅၅၀၀ ကျပ်)', 
			'ဝက်စဥကြော် (၄၅၀၀ ကျပ်)', 
			'တုံယမ်းဟင်းချို (၇၀၀၀ ကျပ်)']],
		['ရိုးရိုးလေး', [
			'ဝက်သားနှပ် (၃၅၀၀ ကျပ်)', 
			'ကြက်သည်းမြစ် (၂၅၀၀ ကျပ်)', 
			'အရွက်စုံကြော် (၂၀၀၀ ကျပ်)', 
			'ငါးပိချက် (၁၅၀၀ ကျပ်)']],
		['Million Coins',[
			'ခေါက်ဆွဲကြွပ်ကြော် (၂၀၀၀ ကျပ်)',
			'ကြက်ဥမွှေကြော် (၂၀၀၀ ကျပ်)', 
			'ပေါင်မုန့်မီးကင် (၁၀၀၀ ကျပ်)', 
			'အီတလီခေါက်ဆွဲ  (၃၀၀၀ ကျပ်)']],
		['ကြုံတိုင်းသား', [
			'တောကြက်သားဟင်း (၄၀၀၀ ကျပ်)', 
			'အမဲအူသုပ် (၃၅၀၀ ကျပ်)', 
			'ဂျီသား (၉၀၀၀ ကျပ်)', 
			'ဆတ်သား (၈၀၀၀ ကျပ်)']],
		['ဦးရာကွတ်', [
			'နို့မလိုင် (၁၅၀၀ ကျပ်)', 
			'ဒိန်ချဥ် (၁၅၀၀ ကျပ်)', 
			'သီးစုံကုလားပဲဟင်း (၂၅၀၀ ကျပ်)', 
			'ဆိတ်နှပ် (၄၀၀၀ ကျပ်)']],
		['ဒို့ရိုးရာ', [
			'ကြက်ကချင်ချက် (၃၅၀၀ ကျပ်)', 
			'ခေါင်ရည် (၅၀၀ ကျပ်)', 
			'ငါးပေါင်းဟင်ချို (၄၀၀၀ ကျပ်)', 
			'ပဲပုတ်ထမင်း (၂၀၀၀ ကျပ်)']],
		['စပိုင်စီပေါ့တ်', [
			'ရှူးရှဲသုပ် (၆၀၀၀ ကျပ်)', 
			'မာလာရှမ်းကော (၁၂၀၀၀ ကျပ်)', 
			'ဟော့ပေါ့ (၁၅၀၀၀ ကျပ်)', 
			'အစုံသုပ် (၆၀၀၀ ကျပ်)']],
		['စမူရှီမူလဂျီဆူရှီ', [
			'ထမင်းလိပ်အစုံ (၅၅၀၀ ကျပ်)', 
			'တမ်ပူရာစုံ (၇၀၀၀ ကျပ်)', 
			'ဆာရှီးမိ (၁၂၀၀၀ ကျပ်)', 
			'ဆူပါရှယ်မီနူး (၇၀၀၀၀ ကျပ်)']],
		['ဒေါ်တုတ်ကြီး', [
			'ဝက်ကြံမဆိုင် (၆၅၀၀ ကျပ်)', 
			'ဝက်စတူး (၈၀၀၀ ကျပ်)', 
			'ဝက်ပုန်းရည်ကြီး (၄၀၀၀ ကျပ်)', 
			'ဝက်မြစ်ချဥ် (၅၅၀၀ ကျပ်)']],
		['ရေသူမ', [
			'ဂဏန်းမာလာ (၁၈၀၀၀ ကျပ်)', 
			'ဆယ်လမွန်သုပ် (၉၀၀၀ ကျပ်)',
			'ရေဘဝဲကင် (၅၀၀၀ ကျပ်)', 
			'ခရုသုပ် (၄၀၀၀ ကျပ်)']],
		['ခိုင်လီ', [
			'ကြက်ချဥ်စပ် (၆၀၀၀ ကျပ်)', 
			'ငါးသံပုရာပေါင်း (၅၅၀၀ ကျပ်)', 
			'ဝက်စဥကြော် (၄၅၀၀ ကျပ်)', 
			'တုံယမ်းဟင်းချို (၇၀၀၀ ကျပ်)']],
		['ရိုးရိုးလေး', [
			'ဝက်သားနှပ် (၃၅၀၀ ကျပ်)', 
			'ကြက်သည်းမြစ် (၂၅၀၀ ကျပ်)', 
			'အရွက်စုံကြော် (၂၀၀၀ ကျပ်)', 
			'ငါးပိချက် (၁၅၀၀ ကျပ်)']],
		['Million Coins',[
			'ခေါက်ဆွဲကြွပ်ကြော် (၂၀၀၀ ကျပ်)',
			'ကြက်ဥမွှေကြော် (၂၀၀၀ ကျပ်)', 
			'ပေါင်မုန့်မီးကင် (၁၀၀၀ ကျပ်)', 
			'အီတလီခေါက်ဆွဲ  (၃၀၀၀ ကျပ်)']],
		['ကြုံတိုင်းသား', [
			'တောကြက်သားဟင်း (၄၀၀၀ ကျပ်)', 
			'အမဲအူသုပ် (၃၅၀၀ ကျပ်)', 
			'ဂျီသား (၉၀၀၀ ကျပ်)', 
			'ဆတ်သား (၈၀၀၀ ကျပ်)']],
		['ဦးရာကွတ်', [
			'နို့မလိုင် (၁၅၀၀ ကျပ်)', 
			'ဒိန်ချဥ် (၁၅၀၀ ကျပ်)', 
			'သီးစုံကုလားပဲဟင်း (၂၅၀၀ ကျပ်)', 
			'ဆိတ်နှပ် (၄၀၀၀ ကျပ်)']],
		['ဒို့ရိုးရာ', [
			'ကြက်ကချင်ချက် (၃၅၀၀ ကျပ်)', 
			'ခေါင်ရည် (၅၀၀ ကျပ်)', 
			'ငါးပေါင်းဟင်ချို (၄၀၀၀ ကျပ်)', 
			'ပဲပုတ်ထမင်း (၂၀၀၀ ကျပ်)']],
		['စပိုင်စီပေါ့တ်', [
			'ရှူးရှဲသုပ် (၆၀၀၀ ကျပ်)', 
			'မာလာရှမ်းကော (၁၂၀၀၀ ကျပ်)', 
			'ဟော့ပေါ့ (၁၅၀၀၀ ကျပ်)', 
			'အစုံသုပ် (၆၀၀၀ ကျပ်)']],
		['စမူရှီမူလဂျီဆူရှီ', [
			'ထမင်းလိပ်အစုံ (၅၅၀၀ ကျပ်)', 
			'တမ်ပူရာစုံ (၇၀၀၀ ကျပ်)', 
			'ဆာရှီးမိ (၁၂၀၀၀ ကျပ်)', 
			'ဆူပါရှယ်မီနူး (၇၀၀၀၀ ကျပ်)']],
		['ဒေါ်တုတ်ကြီး', [
			'ဝက်ကြံမဆိုင် (၆၅၀၀ ကျပ်)', 
			'ဝက်စတူး (၈၀၀၀ ကျပ်)', 
			'ဝက်ပုန်းရည်ကြီး (၄၀၀၀ ကျပ်)', 
			'ဝက်မြစ်ချဥ် (၅၅၀၀ ကျပ်)']],
		['ရေသူမ', [
			'ဂဏန်းမာလာ (၁၈၀၀၀ ကျပ်)', 
			'ဆယ်လမွန်သုပ် (၉၀၀၀ ကျပ်)',
			'ရေဘဝဲကင် (၅၀၀၀ ကျပ်)', 
			'ခရုသုပ် (၄၀၀၀ ကျပ်)']],
		['ခိုင်လီ', [
			'ကြက်ချဥ်စပ် (၆၀၀၀ ကျပ်)', 
			'ငါးသံပုရာပေါင်း (၅၅၀၀ ကျပ်)', 
			'ဝက်စဥကြော် (၄၅၀၀ ကျပ်)', 
			'တုံယမ်းဟင်းချို (၇၀၀၀ ကျပ်)']],
		['ရိုးရိုးလေး', [
			'ဝက်သားနှပ် (၃၅၀၀ ကျပ်)', 
			'ကြက်သည်းမြစ် (၂၅၀၀ ကျပ်)', 
			'အရွက်စုံကြော် (၂၀၀၀ ကျပ်)', 
			'ငါးပိချက် (၁၅၀၀ ကျပ်)']],
		['Million Coins',[
			'ခေါက်ဆွဲကြွပ်ကြော် (၂၀၀၀ ကျပ်)',
			'ကြက်ဥမွှေကြော် (၂၀၀၀ ကျပ်)', 
			'ပေါင်မုန့်မီးကင် (၁၀၀၀ ကျပ်)', 
			'အီတလီခေါက်ဆွဲ  (၃၀၀၀ ကျပ်)']],
		['ကြုံတိုင်းသား', [
			'တောကြက်သားဟင်း (၄၀၀၀ ကျပ်)', 
			'အမဲအူသုပ် (၃၅၀၀ ကျပ်)', 
			'ဂျီသား (၉၀၀၀ ကျပ်)', 
			'ဆတ်သား (၈၀၀၀ ကျပ်)']],
		['ဦးရာကွတ်', [
			'နို့မလိုင် (၁၅၀၀ ကျပ်)', 
			'ဒိန်ချဥ် (၁၅၀၀ ကျပ်)', 
			'သီးစုံကုလားပဲဟင်း (၂၅၀၀ ကျပ်)', 
			'ဆိတ်နှပ် (၄၀၀၀ ကျပ်)']],
		['ဒို့ရိုးရာ', [
			'ကြက်ကချင်ချက် (၃၅၀၀ ကျပ်)', 
			'ခေါင်ရည် (၅၀၀ ကျပ်)', 
			'ငါးပေါင်းဟင်ချို (၄၀၀၀ ကျပ်)', 
			'ပဲပုတ်ထမင်း (၂၀၀၀ ကျပ်)']],
		['စပိုင်စီပေါ့တ်', [
			'ရှူးရှဲသုပ် (၆၀၀၀ ကျပ်)', 
			'မာလာရှမ်းကော (၁၂၀၀၀ ကျပ်)', 
			'ဟော့ပေါ့ (၁၅၀၀၀ ကျပ်)', 
			'အစုံသုပ် (၆၀၀၀ ကျပ်)']],
		['စမူရှီမူလဂျီဆူရှီ', [
			'ထမင်းလိပ်အစုံ (၅၅၀၀ ကျပ်)', 
			'တမ်ပူရာစုံ (၇၀၀၀ ကျပ်)', 
			'ဆာရှီးမိ (၁၂၀၀၀ ကျပ်)', 
			'ဆူပါရှယ်မီနူး (၇၀၀၀၀ ကျပ်)']],
		['ဒေါ်တုတ်ကြီး', [
			'ဝက်ကြံမဆိုင် (၆၅၀၀ ကျပ်)', 
			'ဝက်စတူး (၈၀၀၀ ကျပ်)', 
			'ဝက်ပုန်းရည်ကြီး (၄၀၀၀ ကျပ်)', 
			'ဝက်မြစ်ချဥ် (၅၅၀၀ ကျပ်)']],
		['ရေသူမ', [
			'ဂဏန်းမာလာ (၁၈၀၀၀ ကျပ်)', 
			'ဆယ်လမွန်သုပ် (၉၀၀၀ ကျပ်)',
			'ရေဘဝဲကင် (၅၀၀၀ ကျပ်)', 
			'ခရုသုပ် (၄၀၀၀ ကျပ်)']],
		['ခိုင်လီ', [
			'ကြက်ချဥ်စပ် (၆၀၀၀ ကျပ်)', 
			'ငါးသံပုရာပေါင်း (၅၅၀၀ ကျပ်)', 
			'ဝက်စဥကြော် (၄၅၀၀ ကျပ်)', 
			'တုံယမ်းဟင်းချို (၇၀၀၀ ကျပ်)']],
		['ရိုးရိုးလေး', [
			'ဝက်သားနှပ် (၃၅၀၀ ကျပ်)', 
			'ကြက်သည်းမြစ် (၂၅၀၀ ကျပ်)', 
			'အရွက်စုံကြော် (၂၀၀၀ ကျပ်)', 
			'ငါးပိချက် (၁၅၀၀ ကျပ်)']],
		['Million Coins',[
			'ခေါက်ဆွဲကြွပ်ကြော် (၂၀၀၀ ကျပ်)',
			'ကြက်ဥမွှေကြော် (၂၀၀၀ ကျပ်)', 
			'ပေါင်မုန့်မီးကင် (၁၀၀၀ ကျပ်)', 
			'အီတလီခေါက်ဆွဲ  (၃၀၀၀ ကျပ်)']],
		['ကြုံတိုင်းသား', [
			'တောကြက်သားဟင်း (၄၀၀၀ ကျပ်)', 
			'အမဲအူသုပ် (၃၅၀၀ ကျပ်)', 
			'ဂျီသား (၉၀၀၀ ကျပ်)', 
			'ဆတ်သား (၈၀၀၀ ကျပ်)']],
		['ဦးရာကွတ်', [
			'နို့မလိုင် (၁၅၀၀ ကျပ်)', 
			'ဒိန်ချဥ် (၁၅၀၀ ကျပ်)', 
			'သီးစုံကုလားပဲဟင်း (၂၅၀၀ ကျပ်)', 
			'ဆိတ်နှပ် (၄၀၀၀ ကျပ်)']],
		['ဒို့ရိုးရာ', [
			'ကြက်ကချင်ချက် (၃၅၀၀ ကျပ်)', 
			'ခေါင်ရည် (၅၀၀ ကျပ်)', 
			'ငါးပေါင်းဟင်ချို (၄၀၀၀ ကျပ်)', 
			'ပဲပုတ်ထမင်း (၂၀၀၀ ကျပ်)']],
		['စပိုင်စီပေါ့တ်', [
			'ရှူးရှဲသုပ် (၆၀၀၀ ကျပ်)', 
			'မာလာရှမ်းကော (၁၂၀၀၀ ကျပ်)', 
			'ဟော့ပေါ့ (၁၅၀၀၀ ကျပ်)', 
			'အစုံသုပ် (၆၀၀၀ ကျပ်)']],
		['စမူရှီမူလဂျီဆူရှီ', [
			'ထမင်းလိပ်အစုံ (၅၅၀၀ ကျပ်)', 
			'တမ်ပူရာစုံ (၇၀၀၀ ကျပ်)', 
			'ဆာရှီးမိ (၁၂၀၀၀ ကျပ်)', 
			'ဆူပါရှယ်မီနူး (၇၀၀၀၀ ကျပ်)']],
		['ဒေါ်တုတ်ကြီး', [
			'ဝက်ကြံမဆိုင် (၆၅၀၀ ကျပ်)', 
			'ဝက်စတူး (၈၀၀၀ ကျပ်)', 
			'ဝက်ပုန်းရည်ကြီး (၄၀၀၀ ကျပ်)', 
			'ဝက်မြစ်ချဥ် (၅၅၀၀ ကျပ်)']],
		['ရေသူမ', [
			'ဂဏန်းမာလာ (၁၈၀၀၀ ကျပ်)', 
			'ဆယ်လမွန်သုပ် (၉၀၀၀ ကျပ်)',
			'ရေဘဝဲကင် (၅၀၀၀ ကျပ်)', 
			'ခရုသုပ် (၄၀၀၀ ကျပ်)']]
	]

var groshop_arr = 
	[
		['စီးတီးမတ်' , [
			'ဆန်၊ ဆီ၊ ဆား',
			'ကြက်သွန်ဖြူ၊ နီ၊ ဂျင်း',
			'ဆပ်ပြာမှုန့်၊ ဆပ်ပြာခဲ',
			'သွားတိုက်ဆေး၊ တံ']],
		['ကန်းထရီးမတ်', [
			'နွားနို့၊ ပေါင်မုန့်၊ ယိုစုံ',
			'ဘီစကွတ်၊ အာလူးကြော်၊ မိုင်လို',
			'ခေါက်ဆွဲခြောက်မျိုးစုံ၊ ဖုန်းငွေဖြည့်ကဒ်',
			'ကော်ဖီမစ်၊ မိုင်လို၊ ကွေကာ']],
		['ပလန်းနက်မတ်' , [
			'အာလူး၊ ခရမ်းချဥ်သီး၊ ခရမ်းသီး',
			'ဒဏ်ကြေလိမ်းဆေး၊ ရှုဆေး၊',
			'ပလာစတာ၊ ပတ်တီး၊ ဘီတာဒင်း',
			'အစာကြေဆေး၊ လေဆေး']],
		['ဘာညာသာရကာမတ်', [
			'ခြုံစောင်၊ ခြင်ထောင်၊ ခေါင်းအုံး',
			'အိပ်ယာခင်း၊ မွေ့ယာ၊ ခေါင်းအုံးစွပ်',
			'ခြင်ဆေးခွေ၊ ခြင်နိုင်လိမ်းဆေး',
			'စာအုပ်၊ ဘောပင်၊ စာရေးကိရိယာ']],
		['ABC mart' , [
			'orance juice',
			'watermelon juice',
			'water bottle',
			'Sprite']],
		['Seven Elevent', [
			'Milk',
			'Pudding',
			'Bread',
			'Nann']],
		['စီးတီးမတ်' , [
			'ဆန်၊ ဆီ၊ ဆား',
			'ကြက်သွန်ဖြူ၊ နီ၊ ဂျင်း',
			'ဆပ်ပြာမှုန့်၊ ဆပ်ပြာခဲ',
			'သွားတိုက်ဆေး၊ တံ']],
		['ကန်းထရီးမတ်', [
			'နွားနို့၊ ပေါင်မုန့်၊ ယိုစုံ',
			'ဘီစကွတ်၊ အာလူးကြော်၊ မိုင်လို',
			'ခေါက်ဆွဲခြောက်မျိုးစုံ၊ ဖုန်းငွေဖြည့်ကဒ်',
			'ကော်ဖီမစ်၊ မိုင်လို၊ ကွေကာ']],
		['ပလန်းနက်မတ်' , [
			'အာလူး၊ ခရမ်းချဥ်သီး၊ ခရမ်းသီး',
			'ဒဏ်ကြေလိမ်းဆေး၊ ရှုဆေး၊',
			'ပလာစတာ၊ ပတ်တီး၊ ဘီတာဒင်း',
			'အစာကြေဆေး၊ လေဆေး']],
		['ဘာညာသာရကာမတ်', [
			'ခြုံစောင်၊ ခြင်ထောင်၊ ခေါင်းအုံး',
			'အိပ်ယာခင်း၊ မွေ့ယာ၊ ခေါင်းအုံးစွပ်',
			'ခြင်ဆေးခွေ၊ ခြင်နိုင်လိမ်းဆေး',
			'စာအုပ်၊ ဘောပင်၊ စာရေးကိရိယာ']],
		['ABC mart' , [
			'orance juice',
			'watermelon juice',
			'water bottle',
			'Sprite']],
		['Seven Elevent', [
			'Milk',
			'Pudding',
			'Bread',
			'Nann']],
		['စီးတီးမတ်' , [
			'ဆန်၊ ဆီ၊ ဆား',
			'ကြက်သွန်ဖြူ၊ နီ၊ ဂျင်း',
			'ဆပ်ပြာမှုန့်၊ ဆပ်ပြာခဲ',
			'သွားတိုက်ဆေး၊ တံ']],
		['ကန်းထရီးမတ်', [
			'နွားနို့၊ ပေါင်မုန့်၊ ယိုစုံ',
			'ဘီစကွတ်၊ အာလူးကြော်၊ မိုင်လို',
			'ခေါက်ဆွဲခြောက်မျိုးစုံ၊ ဖုန်းငွေဖြည့်ကဒ်',
			'ကော်ဖီမစ်၊ မိုင်လို၊ ကွေကာ']],
		['ပလန်းနက်မတ်' , [
			'အာလူး၊ ခရမ်းချဥ်သီး၊ ခရမ်းသီး',
			'ဒဏ်ကြေလိမ်းဆေး၊ ရှုဆေး၊',
			'ပလာစတာ၊ ပတ်တီး၊ ဘီတာဒင်း',
			'အစာကြေဆေး၊ လေဆေး']],
		['ဘာညာသာရကာမတ်', [
			'ခြုံစောင်၊ ခြင်ထောင်၊ ခေါင်းအုံး',
			'အိပ်ယာခင်း၊ မွေ့ယာ၊ ခေါင်းအုံးစွပ်',
			'ခြင်ဆေးခွေ၊ ခြင်နိုင်လိမ်းဆေး',
			'စာအုပ်၊ ဘောပင်၊ စာရေးကိရိယာ']],
		['ABC mart' , [
			'orance juice',
			'watermelon juice',
			'water bottle',
			'Sprite']],
		['Seven Elevent', [
			'Milk',
			'Pudding',
			'Bread',
			'Nann']],
		['စီးတီးမတ်' , [
			'ဆန်၊ ဆီ၊ ဆား',
			'ကြက်သွန်ဖြူ၊ နီ၊ ဂျင်း',
			'ဆပ်ပြာမှုန့်၊ ဆပ်ပြာခဲ',
			'သွားတိုက်ဆေး၊ တံ']],
		['ကန်းထရီးမတ်', [
			'နွားနို့၊ ပေါင်မုန့်၊ ယိုစုံ',
			'ဘီစကွတ်၊ အာလူးကြော်၊ မိုင်လို',
			'ခေါက်ဆွဲခြောက်မျိုးစုံ၊ ဖုန်းငွေဖြည့်ကဒ်',
			'ကော်ဖီမစ်၊ မိုင်လို၊ ကွေကာ']],
		['ပလန်းနက်မတ်' , [
			'အာလူး၊ ခရမ်းချဥ်သီး၊ ခရမ်းသီး',
			'ဒဏ်ကြေလိမ်းဆေး၊ ရှုဆေး၊',
			'ပလာစတာ၊ ပတ်တီး၊ ဘီတာဒင်း',
			'အစာကြေဆေး၊ လေဆေး']],
		['ဘာညာသာရကာမတ်', [
			'ခြုံစောင်၊ ခြင်ထောင်၊ ခေါင်းအုံး',
			'အိပ်ယာခင်း၊ မွေ့ယာ၊ ခေါင်းအုံးစွပ်',
			'ခြင်ဆေးခွေ၊ ခြင်နိုင်လိမ်းဆေး',
			'စာအုပ်၊ ဘောပင်၊ စာရေးကိရိယာ']],
		['ABC mart' , [
			'orance juice',
			'watermelon juice',
			'water bottle',
			'Sprite']],
		['Seven Elevent', [
			'Milk',
			'Pudding',
			'Bread',
			'Nann']],
		['စီးတီးမတ်' , [
			'ဆန်၊ ဆီ၊ ဆား',
			'ကြက်သွန်ဖြူ၊ နီ၊ ဂျင်း',
			'ဆပ်ပြာမှုန့်၊ ဆပ်ပြာခဲ',
			'သွားတိုက်ဆေး၊ တံ']],
		['ကန်းထရီးမတ်', [
			'နွားနို့၊ ပေါင်မုန့်၊ ယိုစုံ',
			'ဘီစကွတ်၊ အာလူးကြော်၊ မိုင်လို',
			'ခေါက်ဆွဲခြောက်မျိုးစုံ၊ ဖုန်းငွေဖြည့်ကဒ်',
			'ကော်ဖီမစ်၊ မိုင်လို၊ ကွေကာ']],
		['ပလန်းနက်မတ်' , [
			'အာလူး၊ ခရမ်းချဥ်သီး၊ ခရမ်းသီး',
			'ဒဏ်ကြေလိမ်းဆေး၊ ရှုဆေး၊',
			'ပလာစတာ၊ ပတ်တီး၊ ဘီတာဒင်း',
			'အစာကြေဆေး၊ လေဆေး']],
		['ဘာညာသာရကာမတ်', [
			'ခြုံစောင်၊ ခြင်ထောင်၊ ခေါင်းအုံး',
			'အိပ်ယာခင်း၊ မွေ့ယာ၊ ခေါင်းအုံးစွပ်',
			'ခြင်ဆေးခွေ၊ ခြင်နိုင်လိမ်းဆေး',
			'စာအုပ်၊ ဘောပင်၊ စာရေးကိရိယာ']],
		['ABC mart' , [
			'orance juice',
			'watermelon juice',
			'water bottle',
			'Sprite']],
		['Seven Elevent', [
			'Milk',
			'Pudding',
			'Bread',
			'Nann']],
		['စီးတီးမတ်' , [
			'ဆန်၊ ဆီ၊ ဆား',
			'ကြက်သွန်ဖြူ၊ နီ၊ ဂျင်း',
			'ဆပ်ပြာမှုန့်၊ ဆပ်ပြာခဲ',
			'သွားတိုက်ဆေး၊ တံ']],
		['ကန်းထရီးမတ်', [
			'နွားနို့၊ ပေါင်မုန့်၊ ယိုစုံ',
			'ဘီစကွတ်၊ အာလူးကြော်၊ မိုင်လို',
			'ခေါက်ဆွဲခြောက်မျိုးစုံ၊ ဖုန်းငွေဖြည့်ကဒ်',
			'ကော်ဖီမစ်၊ မိုင်လို၊ ကွေကာ']],
		['ပလန်းနက်မတ်' , [
			'အာလူး၊ ခရမ်းချဥ်သီး၊ ခရမ်းသီး',
			'ဒဏ်ကြေလိမ်းဆေး၊ ရှုဆေး၊',
			'ပလာစတာ၊ ပတ်တီး၊ ဘီတာဒင်း',
			'အစာကြေဆေး၊ လေဆေး']],
		['ဘာညာသာရကာမတ်', [
			'ခြုံစောင်၊ ခြင်ထောင်၊ ခေါင်းအုံး',
			'အိပ်ယာခင်း၊ မွေ့ယာ၊ ခေါင်းအုံးစွပ်',
			'ခြင်ဆေးခွေ၊ ခြင်နိုင်လိမ်းဆေး',
			'စာအုပ်၊ ဘောပင်၊ စာရေးကိရိယာ']],
		['ABC mart' , [
			'orance juice',
			'watermelon juice',
			'water bottle',
			'Sprite']],
		['Seven Elevent', [
			'Milk',
			'Pudding',
			'Bread',
			'Nann']]
	]

//name, township, description
var quarantine_arr = 
	[
		['သုခမြိုင် စင်တာ', 'လှိုင်မြိုနယ်၊ ရန်ကုန်', 'သုခမြိုင် ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၃၈၅ ယောက်ရှိပြီး စားနရိက္ခာနှင့် ဆေးဝါးများလိုအပ်လျှက်ရှိပါသည်။'],
		['သာယာတီ စင်တာ', 'တောင်ဥက္ကလာပ၊ ရန်ကုန်', 'သာယာဝတီ ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၈၅ ယောက်ရှိပြီး အိပ်ယာခင်း၊ သွားတိုက်ဆေး သွားတိုက်တံများ လိုအပ်လျှက်ရှိပါသည်။'],
		['ဗလမင်းထင် စင်တာ', 'သာကေတ', 'ဗလမင်းထင် ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၁၆၅ ယောက်ရှိပြီး ရေချိုးဆပ်ပြာ၊ အဝတ်လျှော်ဆပ်ပြာနှင့် ပုဝါများ လိုအပ်လျှက်ရှိပါသည်။'],
		['ဒဂုံသင်း စင်တာ', 'မြောက်ဒဂုံ၊ ရန်ကုန်', 'ဒဂုံသင်း ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၂၁၄ ယောက်ရှိပြီး နေ့စဥ်စားသောက်စရာများ လိုအပ်လျှက်ရှိပါသည်။'],
		['အင်ကြင်းဖွေး စင်တာ', 'လှိုင်မြိုနယ်၊ ရန်ကုန်', 'သုခမြိုင် ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၃၈၅ ယောက်ရှိပြီး စားနရိက္ခာနှင့် ဆေးဝါးများလိုအပ်လျှက်ရှိပါသည်။'],
		['ပပဝတီ စင်တာ', 'တောင်ဥက္ကလာပ၊ ရန်ကုန်', 'သာယာဝတီ ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၈၅ ယောက်ရှိပြီး အိပ်ယာခင်း၊ သွားတိုက်ဆေး သွားတိုက်တံများ လိုအပ်လျှက်ရှိပါသည်။'],
		['ရာဇာဓာတုကလျာ စင်တာ', 'သာကေတ', 'ဗလမင်းထင် ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၁၆၅ ယောက်ရှိပြီး ရေချိုးဆပ်ပြာ၊ အဝတ်လျှော်ဆပ်ပြာနှင့် ပုဝါများ လိုအပ်လျှက်ရှိပါသည်။'],
		['မင်းကနောင် စင်တာ', 'မြောက်ဒဂုံ၊ ရန်ကုန်', 'ဒဂုံသင်း ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၂၁၄ ယောက်ရှိပြီး နေ့စဥ်စားသောက်စရာများ လိုအပ်လျှက်ရှိပါသည်။'],
		['နတ်သျှင်နောင် စင်တာ', 'လှိုင်မြိုနယ်၊ ရန်ကုန်', 'သုခမြိုင် ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၃၈၅ ယောက်ရှိပြီး စားနရိက္ခာနှင့် ဆေးဝါးများလိုအပ်လျှက်ရှိပါသည်။'],
		['ဗလမင်းထင် စင်တာ', 'တောင်ဥက္ကလာပ၊ ရန်ကုန်', 'သာယာဝတီ ကွာရန်တင်းစင်တာတွင် လက်ရှိ သီးခြားနေထိုင်သူ ၈၅ ယောက်ရှိပြီး အိပ်ယာခင်း၊ သွားတိုက်ဆေး သွားတိုက်တံများ လိုအပ်လျှက်ရှိပါသည်။']
	]

var charity_arr =
	[
		['နှင်းဆီကုန်း ရိပ်သာ', 'ဗဟန်း၊ ရန်ကုန်', 'နှင်းဆီကုန်းဘိုးဘွားရိပ်သာနေ ဘိုးဘွားများ ၁၃၈ ယောက်အတွက် ဒဏ်ကြေဆေး၊ သောက်ဆေး၊ လိမ်းဆေးများ လိုအပ်လျှက်ရှိပါသည်။'],
		['ဖြူစင်မေတ္တာ ကျောင်း', 'ရန်ကင်း၊ ရန်ကုန်', 'ဖြူစင်မေတ္တာ ပညာဒါန ကျောင်းရှိ စာသင်သား ၆၃၀ အတွက် စာရေးကိရိယာများ နှင့် သင်ထောက်ကူပစ္စည်းများ လိုအပ်လျှက်ရှိပါသည်။'],
		['ကြည်နူးရိပ် ဂေဟာ', 'စမ်းချောင်း၊ ရန်ကုန်', 'ကြည်နူးရိပ် မိဘမဲ့ ကလေးဂေဟာတွင်ရှိသော ကလေးငယ်များအတွက် အဝတ်အထည်နှင့် ဗလာစာအုပ်များလိုအပ်လျှက်ရှိပါသည်။'],
		['အလင်းတန်း စင်တာ', 'သာကေတ၊ ရန်ကုန်', 'အလင်းတန်း စင်တာရှိ အမြင်အာရုံချို့တဲ့သူ ကလေးငယ်များအတွက် လက်ကိုင်တုတ်များနှင့် ရေချိုးခန်းအသုံးအဆောင်များလိုအပ်လျှက်ရှိပါသည်။' ]
	]

var donee_arr =
	[
		['ကလင်းရန်းကွန်အဖွဲ့', 'တာဝ၊ ရန်ကုန်', 'ကြုံတိုင်းရွာရှိ ရွာသူ၊ ရွာသားများ ကြည်လင်သော သောက်သုံးရေရရှိရန်အတွက် ရေသန့်လီတာ ၆ သောင်းအလှူခံလိုပါသည်။'],
		['ဒိုအိမ်းအဖွဲ့', 'မရမ်းကုန်း၊ ရန်ကုန်', 'အခြေခံလူတန်းစားများ စားဝတ်နေရေးအတွက် ၁၆တင်းဝင် ဆန်အိတ် ၅၀၀၀ အလှူခံလိုပါသည်။'],
		['လှူမယ်အဖွဲ့', 'ပန်းပဲတန်း၊ ရန်ကုန်', 'လှူမယ် အဖွဲ့သားများ စားဝတ်နေရေးအတွက် တစ်ပတ်စာ စားစရာအလှူခံလိုပါသည်။'],
	]

var shopID_arr = new Array;
var selectedDohType = ['food.html', 'grocery.html']
var doneeNavCtrl = restauNavCtrl = grocerNavCtrl = 1;
var nam = 0; 

$(function (){
	$('.dohbtn').on('click touchend', function(e){
		e.preventDefault();
		var which1 = e.currentTarget.id;

		//define local var to decide donor or donee.
		var url;
		which1 === 'food' ? url = 'food.html' : url = 'grocery.html';
		
		selectedDohType.push(url);
		

		//load the page
		window.location.href = url;
		
	});
	
	for (var i = 1; i < 11; i++) {
		shopID_arr.push('#shop' + i);
	}
	

	
	$('#proceedtouserinfo').on('click touchend', function(e){
		e.preventDefault();
		window.location.href = 'userinfo.html';
	});
	
	$('#backtodoselection').on('click touchend', function(e){
		e.preventDefault();
		window.location.href = 'index.html';
	});
	
	$('#proceed').on('click touchend', function(e){
		e.preventDefault();
		
		var acknowledgement = 'လှူဖွယ်ပစ္စည်း အချက်အလက်ကို Kutho Fund မှလက်ခံရရှိကြောင်း အကြောင်းကြားအပ်ပါသည်။'
		acknowledgement += ' မကြာမှီအချိန်တွင်  လှူဖွယ်အစီစဥ်အသေးစိတ်ညှိနှိုင်းရန် ကျနော်တို့ KTF မှ ဆက်သွယ်ပါမည်။';
		window.alert(acknowledgement);
	});
	
	$('#back').on('click touchend', function(e){
		e.preventDefault();
		history.go(-1);
	});
	
	$('#doneenavbackbtn, #restaunavbackbtn, #grocernavbackbtn').css('visibility', 'hidden');

	
	$('#grocernavbackbtn, #grocernavforbtn').on('click touchend', function(e){
		e.preventDefault();
		var clickedID = e.currentTarget.id;
		
		$('.grocerselectionbar .pg' + grocerNavCtrl).removeClass('active');		
		clickedID === 'grocernavbackbtn' ? grocerNavCtrl-- : grocerNavCtrl++;
		clickedID === 'grocernavbackbtn' ? nam -=3 : nam += 3;
		$('.grocerselectionbar .pg' + grocerNavCtrl).addClass('active');
		
		if (grocerNavCtrl > 1) {
			$('#grocernavbackbtn').css('visibility', 'visible');
		} else {
			$('#grocernavbackbtn').css('visibility', 'hidden')
		}
		
		if (grocerNavCtrl > 9) {
			$('#grocernavforbtn').css('visibility', 'hidden');
		} else {
			$('#grocernavforbtn').css('visibility', 'visible');
		}
		
		grocerSetup(nam);
	});
		
	$('#restaunavbackbtn, #restaunavforbtn').on('click touchend', function(e){
		e.preventDefault();
		var clickedID = e.currentTarget.id;
		
		$('.restauselectionbar .pg' + restauNavCtrl).removeClass('active');		
		clickedID === 'restaunavbackbtn' ? restauNavCtrl-- : restauNavCtrl++;
		clickedID === 'restaunavbackbtn' ? nam -=3 : nam += 3;
		
		$('.restauselectionbar .pg' + restauNavCtrl).addClass('active');
		
		if (restauNavCtrl > 1) {
			$('#restaunavbackbtn').css('visibility', 'visible');
		} else {
			$('#restaunavbackbtn').css('visibility', 'hidden')
		}
		
		if (restauNavCtrl > 9) {
			$('#restaunavforbtn').css('visibility', 'hidden');
		} else {
			$('#restaunavforbtn').css('visibility', 'visible');
		}
		
		console.log(nam);
		menuSetup(nam);
	});
	
	menuSetup(nam);
	grocerSetup(nam);
	loadDonee();
	
});

//can use these two codes for setting up menu items for both grocery and restaurant later
/*
	var test = window.location.href;
	console.log(test);
*/

function loadDonee() {
	//load the array elements here
	var neeID = 0;
	$('.doneeName').text(quarantine_arr[neeID][0]);
	$('.doneeLocation').text(quarantine_arr[neeID][1]);
	$('.doneeDescription').text(quarantine_arr[neeID][2]);	
	
	$('#doneenavbackbtn, #doneenavforbtn').on('click touchend', function(e) {
		e.preventDefault();
		var clickedID = e.currentTarget.id;
		
		$('.doneeselectionbar .pg' + doneeNavCtrl).removeClass('active');
		clickedID === 'doneenavbackbtn' ? doneeNavCtrl-- : doneeNavCtrl++;
		clickedID === 'doneenavbackbtn' ? neeID-- : neeID++;
		$('.doneeselectionbar .pg' + doneeNavCtrl).addClass('active');
		
		//update the elements here
		$('.doneeName').text(quarantine_arr[neeID][0]);
		$('.doneeLocation').text(quarantine_arr[neeID][1]);
		$('.doneeDescription').text(quarantine_arr[neeID][2]);
		
		if (doneeNavCtrl > 1) {
			$('#doneenavbackbtn').css('visibility', 'visible');
		} else {
			$('#doneenavbackbtn').css('visibility', 'hidden')
		}
		
		if (doneeNavCtrl > 9) {
			$('#doneenavforbtn').css('visibility', 'hidden');
		} else {
			$('#doneenavforbtn').css('visibility', 'visible');
		}
	});
	
}

function menuSetup(nam) {
	
	var x= 1; 
	for (var i = nam; i < nam+4; i++) {
		
		for (var j = 0; j < restshop_arr[nam][1].length; j++){
			
			var y = j+1;
			
			$('#shop' + x).find('.shopName').text(restshop_arr[i][0]);
			$('#shop' + x).find('.set' + y).text(restshop_arr[i][1][j]);
			
			y++;
		}
		x++;
	}
}

function grocerSetup(nam) {

	var x= 1;
	
	for (var i = nam; i < nam+3; i++) {
		
		for (var j = 0; j < groshop_arr[nam][1].length; j++) {
			
			var y = j+1;
			
			$('#grocer' + x).find('.shopName').text(groshop_arr[i][0]);
			$('#grocer' + x).find('.set' + y).text(groshop_arr[i][1][j]);
			
			y++;
		}
		x++;
	}
}